OpenFOAM-5/chapter4/multiRegionHeaterFine/system/surrondingSolid/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

    T
    {
        internalField   uniform 300;

        boundaryField
        {
            ".*"
            {
                type            zeroGradient;
                value           uniform 300;
            }
            "surrondingSolid_to_.*"
            {
                type            compressible::turbulentTemperatureCoupledBaffleMixed;
                Tnbr            T;
                //kappa           solidThermo;
		kappaMethod solidThermo;
                kappaName       none;
                //K               solidThermo; //syntax for previous version of OpenFOAM
                //KName           none;
                value           uniform 300;
            }
	    minY
            {
                type            fixedValue;
                value           uniform 300;
            }
        }
    }

// ************************************************************************* //
